<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [160]:
import pandas as pd
import psycopg2

In [162]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
)

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [163]:
# текст запроса
query_3_1 = f'''select count(*) "количество вакансий"
                 from public.vacancies
                '''

In [164]:
df = pd.read_sql_query(query_3_1, connection)
df

C:\Users\jusyp\AppData\Local\Temp\ipykernel_21716\3851344990.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_1, connection)

   количество вакансий
0                49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [165]:
query_3_2 = f'''select count(distinct id) "количество работодателей"
                from public.employers
                '''

In [166]:
pd.read_sql_query(query_3_2, connection)

C:\Users\jusyp\AppData\Local\Temp\ipykernel_21716\1321910889.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_3_2, connection)

   количество работодателей
0                     23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [167]:
query_3_3 = f'''select count(id) "количество регионов"
from public.areas'''

In [168]:
pd.read_sql_query(query_3_3, connection)

C:\Users\jusyp\AppData\Local\Temp\ipykernel_21716\169222152.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_3_3, connection)

   количество регионов
0                 1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [169]:
query_3_4 = f'''select count(*) "количество сфер деятельности"
from public.industries'''

In [170]:
pd.read_sql_query(query_3_4, connection)

C:\Users\jusyp\AppData\Local\Temp\ipykernel_21716\2934468070.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_3_4, connection)

   количество сфер деятельности
0                           294

***

Общее количество вакансий превышает общее количество работодателей. У некоторых работодателей открыто несколько вакансий в сфере IT.

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [171]:
query_4_1 = f'''select
            a.name area,
            count(v.id) cnt
            from public.vacancies v join public.areas a on v.area_id = a.id
            group by 1
            order by 2 desc
            limit 5'''

In [172]:
pd.read_sql_query(query_4_1, connection)

C:\Users\jusyp\AppData\Local\Temp\ipykernel_21716\1702194938.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_4_1, connection)

              area   cnt
0           Москва  5333
1  Санкт-Петербург  2851
2            Минск  2112
3      Новосибирск  2006
4           Алматы  1892

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [173]:
query_4_2 = f'''select count(id)
                from public.vacancies
                where salary_from is not null or salary_to is not null'''

In [174]:
pd.read_sql_query(query_4_2, connection)

C:\Users\jusyp\AppData\Local\Temp\ipykernel_21716\495373726.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_4_2, connection)

   count
0  24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [175]:
query_4_3 = f'''select
                round(avg(salary_from)) "Среднее нижней зарплаты",
                round(avg(salary_to)) "Среднее верхней зарплаты"
                from public.vacancies'''

In [176]:
pd.read_sql_query(query_4_3, connection)

C:\Users\jusyp\AppData\Local\Temp\ipykernel_21716\2240822411.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_4_3, connection)

   Среднее нижней зарплаты  Среднее верхней зарплаты
0                  71065.0                  110537.0

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [177]:
query_4_4 = f'''select
                schedule, employment,
                count(id)
                from public.vacancies
                group by 1, 2
                order by 3 desc'''

In [178]:
pd.read_sql_query(query_4_4, connection)

C:\Users\jusyp\AppData\Local\Temp\ipykernel_21716\3130347181.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_4_4, connection)

            schedule           employment  count
0        Полный день     Полная занятость  35367
1   Удаленная работа     Полная занятость   7802
2      Гибкий график     Полная занятость   1593
3   Удаленная работа  Частичная занятость   1312
4     Сменный график     Полная занятость    940
5        Полный день           Стажировка    569
6     Вахтовый метод     Полная занятость    367
7        Полный день  Частичная занятость    347
8      Гибкий график  Частичная занятость    312
9        Полный день     Проектная работа    141
10  Удаленная работа     Проектная работа    133
11     Гибкий график           Стажировка    116
12    Сменный график  Частичная занятость    101
13  Удаленная работа           Стажировка     64
14     Гибкий график     Проектная работа     18
15    Сменный график           Стажировка     12
16    Вахтовый метод     Проектная работа      2
17    Сменный график     Проектная работа      1

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [179]:
query_4_5 = f'''select
                experience,
                count(id)
                from public.vacancies
                group by 1
                order by 2 asc'''

In [180]:
pd.read_sql_query(query_4_5, connection)

C:\Users\jusyp\AppData\Local\Temp\ipykernel_21716\3496489661.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_4_5, connection)

           experience  count
0         Более 6 лет   1337
1           Нет опыта   7197
2       От 3 до 6 лет  14511
3  От 1 года до 3 лет  26152

***

Большинство вакансий локализованы в Москве и Санкт-Петербурге, с полной занятосью,  очным, либо удаленным графиком работы. С зарплатой от 70000 до 110000 руб. и с опытом работы от года до 6 лет.

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [181]:
query_5_1 = f'''(select
                e.name,
                count(e.id) cnt
                from public.vacancies s join employers e on s.employer_id = e.id
                group by 1
                order by 2 desc
                limit 1 offset 4)
                union
                (select
                ee.name,
                count(ee.id) cnt
                from public.vacancies ss join employers ee on ss.employer_id = ee.id
                group by 1
                order by 2 desc
                limit 1)
                order by 2 desc'''

In [182]:
pd.read_sql_query(query_5_1, connection)

C:\Users\jusyp\AppData\Local\Temp\ipykernel_21716\2735860424.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_5_1, connection)

            name   cnt
0         Яндекс  1933
1  Газпром нефть   331

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [183]:
query_5_2 = f'''select
                    a.name "Регион",
                    count(v.id) as "Вакансии",
                    count(e.id) as "Работодатели"
                from areas a
                    left join employers e ON a.id = e.area
                    left join VACANCIES v ON a.id = v.area_id
                where v.id is null
                group by a.name
                order by 3 desc
                LIMIT 1'''

In [184]:
pd.read_sql_query(query_5_2, connection)

C:\Users\jusyp\AppData\Local\Temp\ipykernel_21716\1514608624.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_5_2, connection)

   Регион  Вакансии  Работодатели
0  Россия         0           410

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [185]:
query_5_3 = f'''select
                    e.name "Компания",
                    count(distinct area_id) "Количество регионов"
                from
                    public.vacancies v join public.employers e on v.employer_id = e.id
                group by 1
                order by 2 desc
                limit 1'''

In [186]:
pd.read_sql_query(query_5_3, connection)

C:\Users\jusyp\AppData\Local\Temp\ipykernel_21716\3071232566.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_5_3, connection)

  Компания  Количество регионов
0   Яндекс                  181

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [187]:
query_5_4 = f'''select count(*) "Работодателей без сферы деятельности"
                from public.employers e left join public.employers_industries w on e.id = w.employer_id
                where industry_id is null'''

In [188]:
pd.read_sql_query(query_5_4, connection)

C:\Users\jusyp\AppData\Local\Temp\ipykernel_21716\2733614102.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_5_4, connection)

   Работодателей без сферы деятельно
0                               8419

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [189]:
query_5_5 = f'''select e.name "Компания",
                count(i.industry_id) "Количество сфер деятельности"
                from public.employers_industries i join employers e on i.employer_id = e.id
                group by 1
                having count(industry_id) = 4
                order by 1 asc
                offset 2 limit 1'''

In [190]:
pd.read_sql_query(query_5_5, connection)

C:\Users\jusyp\AppData\Local\Temp\ipykernel_21716\3334305160.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_5_5, connection)

  Компания  Количество сфер деятельности
0     2ГИС                             4

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [191]:
query_5_6 = f'''select count(*)
                from public.employers_industries e join public.industries i on e.industry_id = i.id
                where i.name = 'Разработка программного обеспечения'
                '''

In [192]:
pd.read_sql_query(query_5_6, connection)

C:\Users\jusyp\AppData\Local\Temp\ipykernel_21716\2432745783.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_5_6, connection)

   count
0   3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [193]:
import requests
from bs4 import BeautifulSoup
import re

url = 'https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8'
response = requests.get(url)
page = BeautifulSoup(response.text, 'html.parser')
string_of_cities = page.find('table', class_='standard').text
clean_strings = re.findall('[А-Яа-я-\s]+', string_of_cities)
clean_strings = [ele for ele in clean_strings if ele != ' ']
city_tuple = tuple(clean_strings[11:])

In [194]:
query_5_7 = f''' 
SELECT 
a.name,
COUNT(v.id) cnt
  FROM vacancies v 
  JOIN employers e ON e.id=v.employer_id
  JOIN areas a ON a.id=v.area_id
  WHERE e.name = 'Яндекс' AND a.name IN {city_tuple}
GROUP BY a.name  

UNION ALL
SELECT
'Total', COUNT(v.id)
  FROM vacancies v 
  JOIN employers e ON e.id=v.employer_id
  JOIN areas a ON a.id=v.area_id
  WHERE e.name = 'Яндекс' AND a.name IN {city_tuple}
GROUP BY e.name
ORDER BY cnt 
'''

In [195]:
query_5_7_df = pd.read_sql_query(query_5_7, connection)
print("Финальная таблица: \n", query_5_7_df)
print('\n')
print("Количество строк в таблице -", query_5_7_df.shape[0])
print("Значение строки `Total' -", query_5_7_df[query_5_7_df['name'] == 'Total']['cnt'].iloc[0])

Финальная таблица:
                name  cnt
0              Омск   21
1         Челябинск   22
2        Красноярск   23
3         Волгоград   24
4             Пермь   25
5            Казань   25
6    Ростов-на-Дону   25
7               Уфа   26
8            Самара   26
9         Краснодар   30
10          Воронеж   32
11      Новосибирск   35
12  Нижний Новгород   36
13     Екатеринбург   39
14  Санкт-Петербург   42
15           Москва   54
16            Total  485


Количество строк в таблице - 17
Значение строки `Total' - 485

C:\Users\jusyp\AppData\Local\Temp\ipykernel_21716\3344869827.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  query_5_7_df = pd.read_sql_query(query_5_7, connection)

***

Яндекс является крупным работадателем с распростарением по территории России. Есть работодатели, которые не ведут деятельность в регионе регистрации. У большинства компаний, сферой деятельности, является разработка ПО.

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [196]:
query_6_1 = f'''select count(*) "Предположительно data science"
                from public.vacancies
                where lower(name) like '%data%' or lower(name) like '%данн%'
                '''

In [197]:
pd.read_sql_query(query_6_1, connection)

C:\Users\jusyp\AppData\Local\Temp\ipykernel_21716\2814080296.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_6_1, connection)

   Предположительно data science
0                           1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [198]:
query_6_2 = f'''select count(id) "Количество вакансий"
                from public.vacancies
                where
                    (lower(name) like '%data scientist%' or
                    lower(name) like '%data science%' or
                    lower(name) like '%исследователь данных%' or
                    (lower(name) like '%ml%' and lower(name) not like '%html%') or
                    lower(name) like '%machine learning%' or
                    lower(name) like '%машинн%обучен%') and 
                    (lower(name) like '%junior%' or
                    lower(experience) like 'нет опыта' or
                    lower(employment) like 'стажировка')'''

In [199]:
pd.read_sql_query(query_6_2, connection)

C:\Users\jusyp\AppData\Local\Temp\ipykernel_21716\3416457153.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_6_2, connection)

   Количество вакансий
0                   51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [200]:
query_6_3 = f'''select 
count(*) "Вакансий для DS"
  from vacancies v
  where (
  lower(v.name) LIKE '%data scientist%' 
  OR lower(v.name) LIKE '%data science%'
  OR lower(v.name) LIKE '%исследователь данных%'
  OR (v.name LIKE '%ML%' AND lower(v.name) NOT LIKE '%html%')
  OR lower(v.name) LIKE '%machine learning%'
  OR lower(v.name) LIKE '%машинн%обучен%'
        )
  AND (
    v.key_skills LIKE '%SQL%'
    OR lower(v.key_skills) LIKE '%postgres%'
	  )
'''

In [201]:
pd.read_sql_query(query_6_3, connection)

C:\Users\jusyp\AppData\Local\Temp\ipykernel_21716\133616535.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_6_3, connection)

   Вакансий для DS
0              201

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [202]:
query_6_4 = f'''SELECT 
            COUNT(*) "Знание Python для соискателя"
            FROM vacancies v
            WHERE (
            lower(v.name) LIKE '%data scientist%' 
            OR lower(v.name) LIKE '%data science%'
            OR lower(v.name) LIKE '%исследователь данных%'
            OR (v.name LIKE '%ML%' AND lower(v.name) NOT LIKE '%html%')
            OR lower(v.name) LIKE '%machine learning%'
            OR lower(v.name) LIKE '%машинн%обучен%'
            )
            AND v.key_skills LIKE '%Python%'
            '''

In [203]:
pd.read_sql_query(query_6_4, connection)

C:\Users\jusyp\AppData\Local\Temp\ipykernel_21716\2825363179.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_6_4, connection)

   Знание Python для соискателя
0                           351

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [204]:
query_6_5 = f'''select
                round(avg(length(key_skills) - length(replace(key_skills, CHR(9), '')) + 1), 2) "Среднее количество навыков"
            FROM vacancies v
            WHERE 
            lower(v.name) LIKE '%data scientist%' 
            OR lower(v.name) LIKE '%data science%'
            OR lower(v.name) LIKE '%исследователь данных%'
            OR (v.name LIKE '%ML%' AND lower(v.name) NOT LIKE '%html%')
            OR lower(v.name) LIKE '%machine learning%'
            OR lower(v.name) LIKE '%машинн%обучен%'
            '''

In [205]:
pd.read_sql_query(query_6_5, connection)

C:\Users\jusyp\AppData\Local\Temp\ipykernel_21716\1879125076.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_6_5, connection)

   Среднее количество навыков
0                        6.41

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [206]:
query_6_6 = f'''select
                experience,
                avg(coalesce((salary_from + salary_to)/2, salary_from, salary_to, 0)) "Средняя зарплата"
            from public.vacancies
            where ( 
            lower(name) LIKE '%data scientist%' 
            OR lower(name) LIKE '%data science%'
            OR lower(name) LIKE '%исследователь данных%'
            OR (name LIKE '%ML%' AND lower(name) NOT LIKE '%html%')
            OR lower(name) LIKE '%machine learning%'
            OR lower(name) LIKE '%машинн%обучен%'
            )
            AND (salary_from IS NOT null
            OR salary_to IS NOT NULL)
            group by experience
            '''

In [207]:
pd.read_sql_query(query_6_6, connection)

C:\Users\jusyp\AppData\Local\Temp\ipykernel_21716\791858229.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query_6_6, connection)

           experience  Средняя зарплата
0           Нет опыта      74642.857143
1  От 1 года до 3 лет     139674.750000
2       От 3 до 6 лет     243114.666667

***

Вакансии DS для junior - 51, что достаточно не много. Вывод: со временем будут повышатся требования для Junior, либо понижение зарплаты.

# Общий вывод по проекту

В общем профессии в IT и DS частности, имеют преспективы.